In [1]:
import pandas as pd
import numpy as np

## Create DataFrame using List

In [2]:
d1 = [[100,'Jhon','Mgr'],[200,'Mary','Prgmr'],[300,'Tom','Clrk']]
df = pd.DataFrame(d1)
df

     0     1      2
0  100  Jhon    Mgr
1  200  Mary  Prgmr
2  300   Tom   Clrk

In [3]:
df1 = pd.DataFrame(d1,columns=['EID','Name','Job'])
df1

   EID  Name    Job
0  100  Jhon    Mgr
1  200  Mary  Prgmr
2  300   Tom   Clrk

In [4]:
df2 = pd.DataFrame(d1,columns=['EID','Name','Job'],index = ['E1','E2','E3'])
df2

    EID  Name    Job
E1  100  Jhon    Mgr
E2  200  Mary  Prgmr
E3  300   Tom   Clrk

+ Ways to Fix the index of DataFrame

In [5]:
df1.set_index('EID',inplace = True)
df1

     Name    Job
EID
100  Jhon    Mgr
200  Mary  Prgmr
300   Tom   Clrk

In [6]:
df.index = ['E1','E2','E3']
df

      0     1      2
E1  100  Jhon    Mgr
E2  200  Mary  Prgmr
E3  300   Tom   Clrk

## Create DataFrame using Dictionary

In [7]:
dict1 = {'Eid':[100,200,300],'Name':['Jhon','Mary','Tom'],'Job':['Mgr','Prgmr','Clrk']}
dict_df = pd.DataFrame(dict1)
dict_df

   Eid  Name    Job
0  100  Jhon    Mgr
1  200  Mary  Prgmr
2  300   Tom   Clrk

In [8]:
type(dict_df)

pandas.core.frame.DataFrame

## Create DataFrame from a csv file

In [9]:
univ_df = pd.read_csv('../datasets/Universities.csv')

## Examine the Data

In [10]:
univ_df.head(3)

      Univ   SAT  Top10  Accept  SFRatio  Expenses  GradRate
0    Brown  1310     89      22       13     22704        94
1  CalTech  1415    100      25        6     63575        81
2      CMU  1260     62      59        9     25026        72

In [11]:
univ_df.tail(3)

          Univ   SAT  Top10  Accept  SFRatio  Expenses  GradRate
22         UVA  1225     77      44       14     13349        92
23  UWisconsin  1085     40      69       15     11857        71
24        Yale  1375     95      19       11     43514        96

In [12]:
univ_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25 entries, 0 to 24
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Univ      25 non-null     object
 1   SAT       25 non-null     int64
 2   Top10     25 non-null     int64
 3   Accept    25 non-null     int64
 4   SFRatio   25 non-null     int64
 5   Expenses  25 non-null     int64
 6   GradRate  25 non-null     int64
dtypes: int64(6), object(1)
memory usage: 1.5+ KB

In [13]:
univ_df.describe()

               SAT       Top10     Accept   SFRatio      Expenses   GradRate
count    25.000000   25.000000  25.000000  25.00000     25.000000  25.000000
mean   1266.440000   76.480000  39.200000  12.72000  27388.000000  86.720000
std     108.359771   19.433905  19.727308   4.06735  14424.883165   9.057778
min    1005.000000   28.000000  14.000000   6.00000   8704.000000  67.000000
25%    1240.000000   74.000000  24.000000  11.00000  15140.000000  81.000000
50%    1285.000000   81.000000  36.000000  12.00000  27553.000000  90.000000
75%    1340.000000   90.000000  50.000000  14.00000  34870.000000  94.000000
max    1415.000000  100.000000  90.000000  25.00000  63575.000000  97.000000

In [14]:
univ_df.index

RangeIndex(start=0, stop=25, step=1)

In [15]:
univ_df.columns

Index(['Univ', 'SAT', 'Top10', 'Accept', 'SFRatio', 'Expenses', 'GradRate'], dtype='object')

In [16]:
univ_df.set_index('Univ',inplace = True)
univ_df.head(3)

          SAT  Top10  Accept  SFRatio  Expenses  GradRate
Univ
Brown    1310     89      22       13     22704        94
CalTech  1415    100      25        6     63575        81
CMU      1260     62      59        9     25026        72

In [17]:
univ_df.index

Index(['Brown', 'CalTech', 'CMU', 'Columbia', 'Cornell', 'Dartmouth', 'Duke',
       'Georgetown', 'Harvard', 'JohnsHopkins', 'MIT', 'Northwestern',
       'NotreDame', 'PennState', 'Princeton', 'Purdue', 'Stanford', 'TexasA&M',
       'UCBerkeley', 'UChicago', 'UMichigan', 'UPenn', 'UVA', 'UWisconsin',
       'Yale'],
      dtype='object', name='Univ')

## To access data of specific university from the frame

In [18]:
univ_df.loc['Columbia']

SAT          1310
Top10          76
Accept         24
SFRatio        12
Expenses    31510
GradRate       88
Name: Columbia, dtype: int64

In [19]:
univ_df.loc['Columbia':'Harvard']

             SAT  Top10  Accept  SFRatio  Expenses  GradRate
Univ
Columbia    1310     76      24       12     31510        88
Cornell     1280     83      33       13     21864        90
Dartmouth   1340     89      23       10     32162        95
Duke        1315     90      30       12     31585        95
Georgetown  1255     74      24       12     20126        92
Harvard     1400     91      14       11     39525        97

In [20]:
univ_df.iloc[1]

SAT          1415
Top10         100
Accept         25
SFRatio         6
Expenses    63575
GradRate       81
Name: CalTech, dtype: int64

In [21]:
univ_df.iloc[1:5]

           SAT  Top10  Accept  SFRatio  Expenses  GradRate
Univ
CalTech   1415    100      25        6     63575        81
CMU       1260     62      59        9     25026        72
Columbia  1310     76      24       12     31510        88
Cornell   1280     83      33       13     21864        90

In [22]:
udf = pd.read_csv('../datasets/Universities.csv', index_col='Univ')

In [23]:
udf['Expenses'] > 40000

Univ
Brown           False
CalTech          True
CMU             False
Columbia        False
Cornell         False
Dartmouth       False
Duke            False
Georgetown      False
Harvard         False
JohnsHopkins     True
MIT             False
Northwestern    False
NotreDame       False
PennState       False
Princeton       False
Purdue          False
Stanford        False
TexasA&M        False
UCBerkeley      False
UChicago        False
UMichigan       False
UPenn           False
UVA             False
UWisconsin      False
Yale             True
Name: Expenses, dtype: bool

In [24]:
udf[udf['Expenses']>40000]

               SAT  Top10  Accept  SFRatio  Expenses  GradRate
Univ
CalTech       1415    100      25        6     63575        81
JohnsHopkins  1305     75      44        7     58691        87
Yale          1375     95      19       11     43514        96

In [25]:
udf[udf['Top10']>90]

             SAT  Top10  Accept  SFRatio  Expenses  GradRate
Univ
CalTech     1415    100      25        6     63575        81
Harvard     1400     91      14       11     39525        97
MIT         1380     94      30       10     34870        91
Princeton   1375     91      14        8     30220        95
UCBerkeley  1240     95      40       17     15140        78
Yale        1375     95      19       11     43514        96

+ keep in the importance of '() & ()' here

In [26]:
udf[(udf['Expenses']>40000) & (udf['Top10']>90) ]

          SAT  Top10  Accept  SFRatio  Expenses  GradRate
Univ
CalTech  1415    100      25        6     63575        81
Yale     1375     95      19       11     43514        96

In [27]:
udf[(udf['Expenses']>40000)|(udf['Top10']>90)]

               SAT  Top10  Accept  SFRatio  Expenses  GradRate
Univ
CalTech       1415    100      25        6     63575        81
Harvard       1400     91      14       11     39525        97
JohnsHopkins  1305     75      44        7     58691        87
MIT           1380     94      30       10     34870        91
Princeton     1375     91      14        8     30220        95
UCBerkeley    1240     95      40       17     15140        78
Yale          1375     95      19       11     43514        96

In [28]:
# udf['Expenses']
# udf[['Expenses','Top10']]
# udf.iloc[:,4]
#udf.iloc[:,2:5]

## EDA - Exploratory Data Analysis

In [29]:
dframe = pd.DataFrame(
    [
        [1,2,3,'M',23],
        [np.nan,5,6,np.nan,31],
        [7,np.nan,9,'F',12],
        [np.nan,np.nan,np.nan,'M',17]
    ],  columns=['a','b','c','d','e'] 
)
dframe

     a    b    c    d   e
0  1.0  2.0  3.0    M  23
1  NaN  5.0  6.0  NaN  31
2  7.0  NaN  9.0    F  12
3  NaN  NaN  NaN    M  17

+ Drop 'NaN' Value

In [30]:
dframe.dropna(inplace=True)
dframe

     a    b    c  d   e
0  1.0  2.0  3.0  M  23

## Drop column with NAN value

In [31]:
dframe = pd.DataFrame(
    [
        [1,2,3,'M',23],
        [np.nan,5,6,np.nan,31],
        [7,np.nan,9,'F',12],
        [np.nan,np.nan,np.nan,'M',17]
    ],  columns=['a','b','c','d','e'] 
)
dframe.dropna(axis = 1)

    e
0  23
1  31
2  12
3  17

In [32]:
dframe

     a    b    c    d   e
0  1.0  2.0  3.0    M  23
1  NaN  5.0  6.0  NaN  31
2  7.0  NaN  9.0    F  12
3  NaN  NaN  NaN    M  17

## Null value imputation - Replace all null value

+ Fill all nul with 0 - heldom used

In [33]:
dframe.fillna(0)

     a    b    c  d   e
0  1.0  2.0  3.0  M  23
1  0.0  5.0  6.0  0  31
2  7.0  0.0  9.0  F  12
3  0.0  0.0  0.0  M  17

In [34]:
dframe

     a    b    c    d   e
0  1.0  2.0  3.0    M  23
1  NaN  5.0  6.0  NaN  31
2  7.0  NaN  9.0    F  12
3  NaN  NaN  NaN    M  17

+ fill with average of all columns

In [35]:
a_avg = dframe['a'].mean()
b_avg = dframe['b'].mean()
c_avg = dframe['c'].mean()
d_mode = dframe['d'].mode()[0] ## since d has an object entry 
e_avg = dframe['e'].mean()
a_avg,b_avg,c_avg,d_mode,e_avg

(4.0, 3.5, 6.0, 'M', 20.75)

In [36]:
dframe.fillna(
              {'a':a_avg,
               'b':b_avg,
               'c':c_avg,
               'd':d_mode,
               'e':e_avg
              },inplace=True
              )
dframe

     a    b    c  d   e
0  1.0  2.0  3.0  M  23
1  4.0  5.0  6.0  M  31
2  7.0  3.5  9.0  F  12
3  4.0  3.5  6.0  M  17

## Drop Duplicate Values

In [37]:
ddup = pd.DataFrame(
    {
    'col1':['A','A','B','B','B'],
    'col2':[2,2,3,2,3]
    }
)
ddup

  col1  col2
0    A     2
1    A     2
2    B     3
3    B     2
4    B     3

In [38]:
ddup.duplicated()

0    False
1     True
2    False
3    False
4     True
dtype: bool

In [39]:
ddup.drop_duplicates()

  col1  col2
0    A     2
2    B     3
3    B     2

## Drop a column

In [40]:
dframe1 = pd.DataFrame(
    [ [1,2,3],[4,5,6],[7,8,9] ],
    index=['SF','LA','NY'],
    columns=['pop','size','year']
)
dframe1

    pop  size  year
SF    1     2     3
LA    4     5     6
NY    7     8     9

In [41]:
dframe1.drop('LA'#,inplace =True for permanent change  
            )

    pop  size  year
SF    1     2     3
NY    7     8     9

In [42]:
dframe1.drop('year',axis=1)

    pop  size
SF    1     2
LA    4     5
NY    7     8

## Rename Column

In [43]:
dframe1.rename(
               columns = {
                   'pop':'Population',
                   'year':'Month'
               })

    Population  size  Month
SF           1     2      3
LA           4     5      6
NY           7     8      9

## Join two DataFrames

In [44]:
d1 = [[1,2,3],[4,5,6],[7,8,9]]
df1 = pd.DataFrame(d1,columns = ['c1','c2','c3'])
df1.head()

   c1  c2  c3
0   1   2   3
1   4   5   6
2   7   8   9

In [45]:
d2 = [[4,7,8],[9,15,16],[17,18,19],[17,18,19]]
df2 = pd.DataFrame(d2,columns = ['c4','c5','c6'])
df2.head()

   c4  c5  c6
0   4   7   8
1   9  15  16
2  17  18  19
3  17  18  19

+ Joining two or more data frame with same column name will return value error - acts like an inner join of SQL

In [46]:
df1.join(df2)

   c1  c2  c3  c4  c5  c6
0   1   2   3   4   7   8
1   4   5   6   9  15  16
2   7   8   9  17  18  19

In [47]:
d3 = [[20,21,22],[23,24,25]]
df3 = pd.DataFrame(d3,columns = ['c1','c2','c3'])

In [48]:
pd.concat([df1,df3])

   c1  c2  c3
0   1   2   3
1   4   5   6
2   7   8   9
0  20  21  22
1  23  24  25

+ Bring the index in continuation

In [49]:
pd.concat([df1,df3],ignore_index=True)

   c1  c2  c3
0   1   2   3
1   4   5   6
2   7   8   9
3  20  21  22
4  23  24  25

+ see DF each entry belongs to

In [50]:
pd.concat([df1,df3],keys=['df1','df3'])

       c1  c2  c3
df1 0   1   2   3
    1   4   5   6
    2   7   8   9
df3 0  20  21  22
    1  23  24  25

In [51]:
pd.concat([df1,df3],keys=['df1','df3'],names=['Series','ID'])

           c1  c2  c3
Series ID
df1    0    1   2   3
       1    4   5   6
       2    7   8   9
df3    0   20  21  22
       1   23  24  25

## Merge Two DataFrame

In [52]:
m1 = {
    'movieid':[1,2,3,4,5],
    'title':['Leo','Jawan','Don','OMG','KGF']
}
movies = pd.DataFrame(m1)
movies

   movieid  title
0        1    Leo
1        2  Jawan
2        3    Don
3        4    OMG
4        5    KGF

In [53]:
m2 = {
    'memid':[1,2,3,4],
    'name':['Tom','Tim','Jon','Jin'],
    'movid':[1,np.NaN,4,2]
}
members = pd.DataFrame(m2)
members

   memid name  movid
0      1  Tom    1.0
1      2  Tim    NaN
2      3  Jon    4.0
3      4  Jin    2.0

+ in merge

In [54]:
inn_merge = pd.merge(movies,members,how='inner',left_on='movieid',right_on='movid')
inn_merge

   movieid  title  memid name  movid
0        1    Leo      1  Tom    1.0
1        2  Jawan      4  Jin    2.0
2        4    OMG      3  Jon    4.0

In [55]:
left_merge = pd.merge(movies,members,how='left',left_on='movieid',right_on='movid')
left_merge

   movieid  title  memid name  movid
0        1    Leo    1.0  Tom    1.0
1        2  Jawan    4.0  Jin    2.0
2        3    Don    NaN  NaN    NaN
3        4    OMG    3.0  Jon    4.0
4        5    KGF    NaN  NaN    NaN

In [56]:
right_merge = pd.merge(movies,members,how='right',left_on='movieid',right_on='movid')
right_merge

   movieid  title  memid name  movid
0      1.0    Leo      1  Tom    1.0
1      NaN    NaN      2  Tim    NaN
2      4.0    OMG      3  Jon    4.0
3      2.0  Jawan      4  Jin    2.0

In [57]:
outer_merge = pd.merge(movies,members,how='outer',left_on='movieid',right_on='movid')
outer_merge

   movieid  title  memid name  movid
0      1.0    Leo    1.0  Tom    1.0
1      2.0  Jawan    4.0  Jin    2.0
2      3.0    Don    NaN  NaN    NaN
3      4.0    OMG    3.0  Jon    4.0
4      5.0    KGF    NaN  NaN    NaN
5      NaN    NaN    2.0  Tim    NaN

In [58]:
cross_merge = pd.merge(movies,members,how='cross')
#cross_merge

## Grouping records

In [59]:
sal = pd.read_csv('../datasets/Salaries.csv')
sal.head()

        rank discipline  phd  service   sex  salary
0       Prof          B   56       49  Male  186960
1       Prof          A   20       20  Male  122400
2  AssocProf          A   20       17  Male   81285
3       Prof          B   23       23  Male  134778
4   AsstProf          B    1        0  Male   88000

In [60]:
sal['rank'].unique()

array(['Prof', 'AssocProf', 'AsstProf'], dtype=object)

In [61]:
sal['rank'].value_counts()

Prof         26
AsstProf     16
AssocProf     9
Name: rank, dtype: int64

In [62]:
grp = sal.groupby('rank')

In [63]:
grp

In [64]:
for x,y in grp:
    print(x)
    print('*'*10)

AssocProf
**********
AsstProf
**********
Prof
**********

In [65]:
for x,y in grp:
    print(y)
    print('*'*50)

         rank discipline  phd  service     sex  salary
2   AssocProf          A   20       17    Male   81285
17  AssocProf          B    9        7    Male  107008
19  AssocProf          B   12        8    Male  119800
23  AssocProf          A   13        8  Female   74830
26  AssocProf          B   11       11  Female  103613
34  AssocProf          B   12       10  Female  103994
37  AssocProf          A   26       24  Female   73300
44  AssocProf          B   12        9  Female   71065
47  AssocProf          B   19        6  Female  104542
**************************************************
        rank discipline  phd  service     sex  salary
4   AsstProf          B    1        0    Male   88000
6   AsstProf          B    8        3    Male   75044
7   AsstProf          B    4        0    Male   92000
10  AsstProf          B    4        4    Male   92000
12  AsstProf          A    4        2    Male   73000
13  AsstProf          A    2        0    Male   85000
15  AsstProf          B    7        2    Male   91300
21  AsstProf          B    4        3    Male   91000
25  AsstProf          B   11        3  Female   74692
28  AsstProf          B   10        5  Female   97032
31  AsstProf          A    5        3  Female   73500
32  AsstProf          A    3        1  Female   72500
35  AsstProf          B    3        3  Female   92000
39  AsstProf          A    7        6  Female   63100
41  AsstProf          A    4        2  Female   77500
43  AsstProf          A    8        3  Female   78500
**************************************************
    rank discipline  phd  service     sex  salary
0   Prof          B   56       49    Male  186960
1   Prof          A   20       20    Male  122400
3   Prof          B   23       23    Male  134778
5   Prof          B   17        3    Male  150480
8   Prof          A   19        7    Male  107300
9   Prof          A   29       27    Male  150500
11  Prof          A   33       30    Male  103106
14  Prof          A   30       23    Male   91100
16  Prof          B   21       20    Male  123683
18  Prof          B   22       21    Male  155750
20  Prof          B   45       45    Male  146856
22  Prof          A   39       36  Female  137000
24  Prof          B   25       25  Female  140096
27  Prof          B   17       17  Female  111512
29  Prof          B   20       14  Female  127512
30  Prof          A   12        0  Female  105000
33  Prof          B   36       26  Female  144651
36  Prof          A   29       27  Female   91000
38  Prof          A   36       19  Female  117555
40  Prof          A   17       11  Female   90450
42  Prof          A   28        7  Female  116450
45  Prof          B   24       15  Female  161101
46  Prof          B   18       10  Female  105450
48  Prof          B   17       17  Female  124312
49  Prof          A   28       14  Female  109954
50  Prof          A   23       15  Female  109646
**************************************************

## Agrregate values calculation for each group

In [66]:
grp.agg(['mean','max','min'])

C:\Users\radha\AppData\Local\Temp\ipykernel_468\1794850583.py:1: FutureWarning: ['discipline', 'sex'] did not aggregate successfully. If any error is raised this will raise in a future version of pandas. Drop these columns/ops to avoid this warning.
  grp.agg(['mean','max','min'])

                 phd            service                 salary
                mean max min       mean max min           mean     max    min
rank
AssocProf  14.888889  26   9  11.111111  24   6   93270.777778  119800  71065
AsstProf    5.312500  11   1   2.500000   6   0   82260.500000   97032  63100
Prof       26.307692  56  12  20.038462  49   0  125561.615385  186960  90450

+ one more to avoid this warning display

In [68]:
numeric_data = sal[['rank','phd','service','salary']]
# numeric_data